spec/support/fixtures/vcr_cassettes/Api_V2_OrdersController/POST_create_/with_a_valid_create_purchases_token/creates_an_order_a_charge_and_a_successful_purchase.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/payment_methods
    body:
      encoding: UTF-8
      string: type=card&card[token]=tok_visa
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/12.5.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      Idempotency-Key:
      - e525b3f6-511a-467b-8242-925546ca6cf0
      Stripe-Version:
      - '2023-10-16'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"12.5.0","lang":"ruby","lang_version":"3.4.3 p32 (2025-04-14)","platform":"arm64-darwin25","engine":"ruby","publisher":"stripe","uname":"Darwin
        CodyBontecoum1.local 25.1.0 Darwin Kernel Version 25.1.0: Mon Oct 20 19:32:41
        PDT 2025; root:xnu-12377.41.6~2/RELEASE_ARM64_T6000 arm64","hostname":"CodyBontecoum1.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 03 May 2026 02:10:42 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1122'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=pEC2LIwEVAeO_EwEYfU3qe6Ir-KjCikc9Upph-zbEU_gU4v_XwQ-XSaexPFO2RDoIzk_4pailCwQMJaY
      Idempotency-Key:
      - e525b3f6-511a-467b-8242-925546ca6cf0
      Original-Request:
      - req_IfbOAFwEhiGRea
      Report-To:
      - '{"group":"csp","max_age":8640,"endpoints":[{"url":"https://q.stripe.com/csp-report-v2?q=pEC2LIwEVAeO_EwEYfU3qe6Ir-KjCikc9Upph-zbEU_gU4v_XwQ-XSaexPFO2RDoIzk_4pailCwQMJaY&t=1"}],"include_subdomains":true}'
      Reporting-Endpoints:
      - csp="https://q.stripe.com/csp-report-v2?q=pEC2LIwEVAeO_EwEYfU3qe6Ir-KjCikc9Upph-zbEU_gU4v_XwQ-XSaexPFO2RDoIzk_4pailCwQMJaY&t=1"
      Request-Id:
      - req_IfbOAFwEhiGRea
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - '2023-10-16'
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - 3c3
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "pm_1TSpUUIBOqvOFDrfwEd5OB9C",
          "object": "payment_method",
          "allow_redisplay": "unspecified",
          "billing_details": {
            "address": {
              "city": null,
              "country": null,
              "line1": null,
              "line2": null,
              "postal_code": null,
              "state": null
            },
            "email": null,
            "name": null,
            "phone": null,
            "tax_id": null
          },
          "card": {
            "brand": "visa",
            "checks": {
              "address_line1_check": null,
              "address_postal_code_check": null,
              "cvc_check": "unchecked"
            },
            "country": "US",
            "display_brand": "visa",
            "exp_month": 5,
            "exp_year": 2027,
            "fingerprint": "hsksJCaNjbEGzjqP",
            "funding": "credit",
            "generated_from": null,
            "last4": "4242",
            "networks": {
              "available": [
                "visa"
              ],
              "preferred": null
            },
            "regulated_status": "unregulated",
            "three_d_secure_usage": {
              "supported": true
            },
            "wallet": null
          },
          "created": 1777774242,
          "customer": null,
          "customer_account": null,
          "livemode": false,
          "metadata": {},
          "shared_payment_granted_token": null,
          "type": "card"
        }
  recorded_at: Sun, 03 May 2026 02:10:42 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/payment_methods/pm_1TSpUUIBOqvOFDrfwEd5OB9C
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/12.5.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_IfbOAFwEhiGRea","request_duration_ms":480}}'
      Stripe-Version:
      - '2023-10-16'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"12.5.0","lang":"ruby","lang_version":"3.4.3 p32 (2025-04-14)","platform":"arm64-darwin25","engine":"ruby","publisher":"stripe","uname":"Darwin
        CodyBontecoum1.local 25.1.0 Darwin Kernel Version 25.1.0: Mon Oct 20 19:32:41
        PDT 2025; root:xnu-12377.41.6~2/RELEASE_ARM64_T6000 arm64","hostname":"CodyBontecoum1.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 03 May 2026 02:10:43 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1122'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=YZ-Bk745M4j4BF-dF0rEuUb1jyNQq7ZrdKvoPTXR3eanLpIFsLZk8mEg7FJSW1b8MYQG6cRnN2e1oX-4
      Report-To:
      - '{"group":"csp","max_age":8640,"endpoints":[{"url":"https://q.stripe.com/csp-report-v2?q=YZ-Bk745M4j4BF-dF0rEuUb1jyNQq7ZrdKvoPTXR3eanLpIFsLZk8mEg7FJSW1b8MYQG6cRnN2e1oX-4&t=1"}],"include_subdomains":true}'
      Reporting-Endpoints:
      - csp="https://q.stripe.com/csp-report-v2?q=YZ-Bk745M4j4BF-dF0rEuUb1jyNQq7ZrdKvoPTXR3eanLpIFsLZk8mEg7FJSW1b8MYQG6cRnN2e1oX-4&t=1"
      Request-Id:
      - req_FxZnWG7110xzzl
      Stripe-Version:
      - '2023-10-16'
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - 3c3
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "pm_1TSpUUIBOqvOFDrfwEd5OB9C",
          "object": "payment_method",
          "allow_redisplay": "unspecified",
          "billing_details": {
            "address": {
              "city": null,
              "country": null,
              "line1": null,
              "line2": null,
              "postal_code": null,
              "state": null
            },
            "email": null,
            "name": null,
            "phone": null,
            "tax_id": null
          },
          "card": {
            "brand": "visa",
            "checks": {
              "address_line1_check": null,
              "address_postal_code_check": null,
              "cvc_check": "unchecked"
            },
            "country": "US",
            "display_brand": "visa",
            "exp_month": 5,
            "exp_year": 2027,
            "fingerprint": "hsksJCaNjbEGzjqP",
            "funding": "credit",
            "generated_from": null,
            "last4": "4242",
            "networks": {
              "available": [
                "visa"
              ],
              "preferred": null
            },
            "regulated_status": "unregulated",
            "three_d_secure_usage": {
              "supported": true
            },
            "wallet": null
          },
          "created": 1777774242,
          "customer": null,
          "customer_account": null,
          "livemode": false,
          "metadata": {},
          "shared_payment_granted_token": null,
          "type": "card"
        }
  recorded_at: Sun, 03 May 2026 02:10:43 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/payment_intents
    body:
      encoding: UTF-8
      string: amount=500&currency=usd&description=Gumroad+Charge+rZRIoAk5W2qtGOs_qEd9IA%3D%3D&metadata[purchases%7B0%7D]=rZRIoAk5W2qtGOs_qEd9IA%3D%3D&transfer_group=CH-4&payment_method_types[0]=card&off_session=false&payment_method=pm_1TSpUUIBOqvOFDrfwEd5OB9C&statement_descriptor_suffix=edgarb0af0a0c3
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/12.5.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_FxZnWG7110xzzl","request_duration_ms":368}}'
      Idempotency-Key:
      - 67963a6b-e2bf-4947-b753-add3bcd6ca3e
      Stripe-Version:
      - '2023-10-16'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"12.5.0","lang":"ruby","lang_version":"3.4.3 p32 (2025-04-14)","platform":"arm64-darwin25","engine":"ruby","publisher":"stripe","uname":"Darwin
        CodyBontecoum1.local 25.1.0 Darwin Kernel Version 25.1.0: Mon Oct 20 19:32:41
        PDT 2025; root:xnu-12377.41.6~2/RELEASE_ARM64_T6000 arm64","hostname":"CodyBontecoum1.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 03 May 2026 02:10:43 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1606'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=YZ-Bk745M4j4BF-dF0rEuUb1jyNQq7ZrdKvoPTXR3eanLpIFsLZk8mEg7FJSW1b8MYQG6cRnN2e1oX-4
      Idempotency-Key:
      - 67963a6b-e2bf-4947-b753-add3bcd6ca3e
      Original-Request:
      - req_p8Kmh3xkVAX4ws
      Report-To:
      - '{"group":"csp","max_age":8640,"endpoints":[{"url":"https://q.stripe.com/csp-report-v2?q=YZ-Bk745M4j4BF-dF0rEuUb1jyNQq7ZrdKvoPTXR3eanLpIFsLZk8mEg7FJSW1b8MYQG6cRnN2e1oX-4&t=1"}],"include_subdomains":true}'
      Reporting-Endpoints:
      - csp="https://q.stripe.com/csp-report-v2?q=YZ-Bk745M4j4BF-dF0rEuUb1jyNQq7ZrdKvoPTXR3eanLpIFsLZk8mEg7FJSW1b8MYQG6cRnN2e1oX-4&t=1"
      Request-Id:
      - req_p8Kmh3xkVAX4ws
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - '2023-10-16'
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - 3c3
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "pi_3TSpUVIBOqvOFDrf1v75c6PM",
          "object": "payment_intent",
          "amount": 500,
          "amount_capturable": 0,
          "amount_details": {
            "tip": {}
          },
          "amount_received": 0,
          "application": null,
          "application_fee_amount": null,
          "automatic_payment_methods": null,
          "canceled_at": null,
          "cancellation_reason": null,
          "capture_method": "automatic",
          "client_secret": "pi_3TSpUVIBOqvOFDrf1v75c6PM_secret_H6D6hZTAfKEn32NmMNzgdoLTU",
          "confirmation_method": "automatic",
          "created": 1777774243,
          "currency": "usd",
          "customer": null,
          "customer_account": null,
          "description": "Gumroad Charge rZRIoAk5W2qtGOs_qEd9IA==",
          "excluded_payment_method_types": null,
          "invoice": null,
          "last_payment_error": null,
          "latest_charge": null,
          "livemode": false,
          "managed_payments": {
            "enabled": false
          },
          "metadata": {
            "purchases{0}": "rZRIoAk5W2qtGOs_qEd9IA=="
          },
          "next_action": null,
          "on_behalf_of": null,
          "payment_method": "pm_1TSpUUIBOqvOFDrfwEd5OB9C",
          "payment_method_configuration_details": null,
          "payment_method_options": {
            "card": {
              "installments": null,
              "mandate_options": null,
              "network": null,
              "request_three_d_secure": "automatic"
            }
          },
          "payment_method_types": [
            "card"
          ],
          "processing": null,
          "receipt_email": null,
          "review": null,
          "setup_future_usage": null,
          "shared_payment_granted_token": null,
          "shipping": null,
          "source": null,
          "statement_descriptor": null,
          "statement_descriptor_suffix": "edgarb0af0a0c3",
          "status": "requires_confirmation",
          "transfer_data": null,
          "transfer_group": "CH-4"
        }
  recorded_at: Sun, 03 May 2026 02:10:43 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/payment_intents/pi_3TSpUVIBOqvOFDrf1v75c6PM/confirm
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/12.5.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_p8Kmh3xkVAX4ws","request_duration_ms":293}}'
      Idempotency-Key:
      - d28b9e1d-b43b-4aab-8500-8a6fc93141d1
      Stripe-Version:
      - '2023-10-16'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"12.5.0","lang":"ruby","lang_version":"3.4.3 p32 (2025-04-14)","platform":"arm64-darwin25","engine":"ruby","publisher":"stripe","uname":"Darwin
        CodyBontecoum1.local 25.1.0 Darwin Kernel Version 25.1.0: Mon Oct 20 19:32:41
        PDT 2025; root:xnu-12377.41.6~2/RELEASE_ARM64_T6000 arm64","hostname":"CodyBontecoum1.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 03 May 2026 02:10:45 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1621'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=YZ-Bk745M4j4BF-dF0rEuUb1jyNQq7ZrdKvoPTXR3eanLpIFsLZk8mEg7FJSW1b8MYQG6cRnN2e1oX-4
      Idempotency-Key:
      - d28b9e1d-b43b-4aab-8500-8a6fc93141d1
      Original-Request:
      - req_ZfRJagx3HzEyri
      Report-To:
      - '{"group":"csp","max_age":8640,"endpoints":[{"url":"https://q.stripe.com/csp-report-v2?q=YZ-Bk745M4j4BF-dF0rEuUb1jyNQq7ZrdKvoPTXR3eanLpIFsLZk8mEg7FJSW1b8MYQG6cRnN2e1oX-4&t=1"}],"include_subdomains":true}'
      Reporting-Endpoints:
      - csp="https://q.stripe.com/csp-report-v2?q=YZ-Bk745M4j4BF-dF0rEuUb1jyNQq7ZrdKvoPTXR3eanLpIFsLZk8mEg7FJSW1b8MYQG6cRnN2e1oX-4&t=1"
      Request-Id:
      - req_ZfRJagx3HzEyri
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - '2023-10-16'
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - 3c3
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "pi_3TSpUVIBOqvOFDrf1v75c6PM",
          "object": "payment_intent",
          "amount": 500,
          "amount_capturable": 0,
          "amount_details": {
            "tip": {}
          },
          "amount_received": 500,
          "application": null,
          "application_fee_amount": null,
          "automatic_payment_methods": null,
          "canceled_at": null,
          "cancellation_reason": null,
          "capture_method": "automatic",
          "client_secret": "pi_3TSpUVIBOqvOFDrf1v75c6PM_secret_H6D6hZTAfKEn32NmMNzgdoLTU",
          "confirmation_method": "automatic",
          "created": 1777774243,
          "currency": "usd",
          "customer": null,
          "customer_account": null,
          "description": "Gumroad Charge rZRIoAk5W2qtGOs_qEd9IA==",
          "excluded_payment_method_types": null,
          "invoice": null,
          "last_payment_error": null,
          "latest_charge": "ch_3TSpUVIBOqvOFDrf10g8KD3O",
          "livemode": false,
          "managed_payments": {
            "enabled": false
          },
          "metadata": {
            "purchases{0}": "rZRIoAk5W2qtGOs_qEd9IA=="
          },
          "next_action": null,
          "on_behalf_of": null,
          "payment_method": "pm_1TSpUUIBOqvOFDrfwEd5OB9C",
          "payment_method_configuration_details": null,
          "payment_method_options": {
            "card": {
              "installments": null,
              "mandate_options": null,
              "network": null,
              "request_three_d_secure": "automatic"
            }
          },
          "payment_method_types": [
            "card"
          ],
          "processing": null,
          "receipt_email": null,
          "review": null,
          "setup_future_usage": null,
          "shared_payment_granted_token": null,
          "shipping": null,
          "source": null,
          "statement_descriptor": null,
          "statement_descriptor_suffix": "edgarb0af0a0c3",
          "status": "succeeded",
          "transfer_data": null,
          "transfer_group": "CH-4"
        }
  recorded_at: Sun, 03 May 2026 02:10:45 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/charges/ch_3TSpUVIBOqvOFDrf10g8KD3O?expand%5B%5D=application_fee.balance_transaction&expand%5B%5D=balance_transaction
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/12.5.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_ZfRJagx3HzEyri","request_duration_ms":1153}}'
      Stripe-Version:
      - '2023-10-16'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"12.5.0","lang":"ruby","lang_version":"3.4.3 p32 (2025-04-14)","platform":"arm64-darwin25","engine":"ruby","publisher":"stripe","uname":"Darwin
        CodyBontecoum1.local 25.1.0 Darwin Kernel Version 25.1.0: Mon Oct 20 19:32:41
        PDT 2025; root:xnu-12377.41.6~2/RELEASE_ARM64_T6000 arm64","hostname":"CodyBontecoum1.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 03 May 2026 02:10:45 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '3719'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=YZ-Bk745M4j4BF-dF0rEuUb1jyNQq7ZrdKvoPTXR3eanLpIFsLZk8mEg7FJSW1b8MYQG6cRnN2e1oX-4
      Report-To:
      - '{"group":"csp","max_age":8640,"endpoints":[{"url":"https://q.stripe.com/csp-report-v2?q=YZ-Bk745M4j4BF-dF0rEuUb1jyNQq7ZrdKvoPTXR3eanLpIFsLZk8mEg7FJSW1b8MYQG6cRnN2e1oX-4&t=1"}],"include_subdomains":true}'
      Reporting-Endpoints:
      - csp="https://q.stripe.com/csp-report-v2?q=YZ-Bk745M4j4BF-dF0rEuUb1jyNQq7ZrdKvoPTXR3eanLpIFsLZk8mEg7FJSW1b8MYQG6cRnN2e1oX-4&t=1"
      Request-Id:
      - req_kEEY5Yv3W1h99j
      Stripe-Version:
      - '2023-10-16'
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - 3c3
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "ch_3TSpUVIBOqvOFDrf10g8KD3O",
          "object": "charge",
          "amount": 500,
          "amount_captured": 500,
          "amount_refunded": 0,
          "application": null,
          "application_fee": null,
          "application_fee_amount": null,
          "balance_transaction": {
            "id": "txn_3TSpUVIBOqvOFDrf1SxuviZ7",
            "object": "balance_transaction",
            "amount": 500,
            "available_on": 1778371200,
            "balance_type": "payments",
            "created": 1777774244,
            "currency": "usd",
            "description": "Gumroad Charge rZRIoAk5W2qtGOs_qEd9IA==",
            "exchange_rate": null,
            "fee": 45,
            "fee_details": [
              {
                "amount": 45,
                "application": null,
                "currency": "usd",
                "description": "Stripe processing fees",
                "type": "stripe_fee"
              }
            ],
            "net": 455,
            "reporting_category": "charge",
            "source": "ch_3TSpUVIBOqvOFDrf10g8KD3O",
            "status": "pending",
            "type": "charge"
          },
          "billing_details": {
            "address": {
              "city": null,
              "country": null,
              "line1": null,
              "line2": null,
              "postal_code": null,
              "state": null
            },
            "email": null,
            "name": null,
            "phone": null,
            "tax_id": null
          },
          "calculated_statement_descriptor": "STRIPE* EDGARB0AF0A0C3",
          "captured": true,
          "created": 1777774244,
          "currency": "usd",
          "customer": null,
          "description": "Gumroad Charge rZRIoAk5W2qtGOs_qEd9IA==",
          "destination": null,
          "dispute": null,
          "disputed": false,
          "failure_balance_transaction": null,
          "failure_code": null,
          "failure_message": null,
          "fraud_details": {},
          "invoice": null,
          "livemode": false,
          "metadata": {
            "purchases{0}": "rZRIoAk5W2qtGOs_qEd9IA=="
          },
          "on_behalf_of": null,
          "order": null,
          "outcome": {
            "advice_code": null,
            "network_advice_code": null,
            "network_decline_code": null,
            "network_status": "approved_by_network",
            "reason": null,
            "risk_level": "normal",
            "risk_score": 44,
            "seller_message": "Payment complete.",
            "type": "authorized"
          },
          "paid": true,
          "payment_intent": "pi_3TSpUVIBOqvOFDrf1v75c6PM",
          "payment_method": "pm_1TSpUUIBOqvOFDrfwEd5OB9C",
          "payment_method_details": {
            "card": {
              "amount_authorized": 500,
              "authorization_code": "973293",
              "brand": "visa",
              "checks": {
                "address_line1_check": null,
                "address_postal_code_check": null,
                "cvc_check": "pass"
              },
              "country": "US",
              "ds_transaction_id": null,
              "exp_month": 5,
              "exp_year": 2027,
              "extended_authorization": {
                "status": "disabled"
              },
              "fingerprint": "hsksJCaNjbEGzjqP",
              "funding": "credit",
              "incremental_authorization": {
                "status": "unavailable"
              },
              "installments": null,
              "last4": "4242",
              "mandate": null,
              "multicapture": {
                "status": "unavailable"
              },
              "network": "visa",
              "network_token": {
                "used": false
              },
              "network_transaction_id": "104115107115746",
              "overcapture": {
                "maximum_amount_capturable": 500,
                "status": "unavailable"
              },
              "regulated_status": "unregulated",
              "three_d_secure": null,
              "wallet": null
            },
            "type": "card"
          },
          "radar_options": {},
          "receipt_email": null,
          "receipt_number": null,
          "receipt_url": "https://pay.stripe.com/receipts/payment/CAcaFwoVYWNjdF8xU05FZ3NJQk9xdk9GRHJmKKXd2s8GMgYLsaCdeFM6LBbxit9yJsc36pQ5gxyFRSlJ9KclJFEFbx0SJLdy1sVEbPezeZ_EfrlzYmA0",
          "refunded": false,
          "review": null,
          "shipping": null,
          "source": null,
          "source_transfer": null,
          "statement_descriptor": null,
          "statement_descriptor_suffix": "edgarb0af0a0c3",
          "status": "succeeded",
          "transfer_data": null,
          "transfer_group": "CH-4"
        }
  recorded_at: Sun, 03 May 2026 02:10:45 GMT
recorded_with: VCR 6.2.0
